Ran Plan for 2 projects:

1. dir: `infra/us-east-1/dev/eks/cluster` workspace: `default`
1. dir: `infra/us-east-1/mgmt/ecr` workspace: `default`

### 1. dir: `infra/us-east-1/dev/eks/cluster` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running "terragrunt plan -input=false -out=$PLANFILE" in "/atlantis-data/repos/input-output-hk/sc-dev-platform/109/default/infra/us-east-1/dev/eks/cluster": exit status 1: running "terragrunt plan -input=false -out=$PLANFILE" in "/atlantis-data/repos/input-output-hk/sc-dev-platform/109/default/infra/us-east-1/dev/eks/cluster": 
time=2024-01-15T14:44:20Z level=warning msg=No double-slash (//) found in source URL /atlantis-data/repos/input-output-hk/sc-dev-platform/109/default/infra/modules/eks. Relative paths in downloaded Terraform code may not work.

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.
Initializing modules...
Downloading registry.terraform.io/terraform-aws-modules/eks/aws 19.17.2 for eks...
- eks in .terraform/modules/eks
- eks.eks_managed_node_group in .terraform/modules/eks/modules/eks-managed-node-group
- eks.eks_managed_node_group.user_data in .terraform/modules/eks/modules/_user_data
- eks.fargate_profile in .terraform/modules/eks/modules/fargate-profile
Downloading registry.terraform.io/terraform-aws-modules/kms/aws 1.1.0 for eks.kms...
- eks.kms in .terraform/modules/eks.kms
- eks.self_managed_node_group in .terraform/modules/eks/modules/self-managed-node-group
- eks.self_managed_node_group.user_data in .terraform/modules/eks/modules/_user_data

Initializing provider plugins...
- Finding hashicorp/tls versions matching ">= 3.0.0"...
- Finding hashicorp/cloudinit versions matching ">= 2.0.0"...
- Finding hashicorp/aws versions matching ">= 3.72.0, >= 4.57.0"...
- Finding hashicorp/kubernetes versions matching ">= 2.10.0"...
- Finding hashicorp/time versions matching ">= 0.9.0"...
- Installing hashicorp/tls v4.0.5...
- Installed hashicorp/tls v4.0.5 (signed by HashiCorp)
- Installing hashicorp/cloudinit v2.3.3...
- Installed hashicorp/cloudinit v2.3.3 (signed by HashiCorp)
- Installing hashicorp/aws v5.32.1...
- Installed hashicorp/aws v5.32.1 (signed by HashiCorp)
- Installing hashicorp/kubernetes v2.25.2...
- Installed hashicorp/kubernetes v2.25.2 (signed by HashiCorp)
- Installing hashicorp/time v0.10.0...
- Installed hashicorp/time v0.10.0 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!
module.eks.module.eks_managed_node_group["worker"].data.aws_partition.current: Reading...
module.eks.module.kms.data.aws_caller_identity.current: Reading...
module.eks.module.kms.data.aws_partition.current: Reading...
module.eks.data.aws_caller_identity.current: Reading...
module.eks.module.eks_managed_node_group["worker"].data.aws_caller_identity.current: Reading...
module.eks.module.kms.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.data.aws_partition.current: Reading...
module.eks.module.eks_managed_node_group["worker"].data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/eks/scde-dev-us-east-1/cluster]
module.eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-0a7572e9048ec02e5]
module.eks.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.data.aws_caller_identity.current: Read complete after 0s [id=677160962006]
module.eks.module.eks_managed_node_group["worker"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.module.eks_managed_node_group["worker"].data.aws_caller_identity.current: Read complete after 0s [id=677160962006]
module.eks.module.kms.data.aws_caller_identity.current: Read complete after 0s [id=677160962006]
module.eks.data.aws_iam_session_context.current: Reading...
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.module.eks_managed_node_group["worker"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2764486067]
module.eks.aws_security_group.node[0]: Refreshing state... [id=sg-0a9d4d88af5b13d3b]
module.eks.aws_iam_role.this[0]: Refreshing state... [id=scde-dev-us-east-1-cluster-20231106143150876200000004]
module.eks.module.eks_managed_node_group["worker"].aws_iam_role.this[0]: Refreshing state... [id=worker-eks-node-group-20231106143150875600000002]
module.eks.module.eks_managed_node_group["worker-memory"].aws_iam_role.this[0]: Refreshing state... [id=worker-memory-eks-node-group-20231220122053332900000001]
module.eks.data.aws_iam_session_context.current: Read complete after 0s [id=arn:aws:sts::677160962006:assumed-role/AtlantisDeploymentRole/aws-go-sdk-1705329879001049095]
module.eks.module.eks_managed_node_group["worker"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=worker-eks-node-group-20231106143150875600000002-20231106143152150700000005]
module.eks.module.eks_managed_node_group["worker"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"]: Refreshing state... [id=worker-eks-node-group-20231106143150875600000002-20231106143152344300000008]
module.eks.module.eks_managed_node_group["worker-memory"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=worker-memory-eks-node-group-20231220122053332900000001-20231220122054262400000003]
module.eks.module.eks_managed_node_group["worker"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=worker-eks-node-group-20231106143150875600000002-20231106143152183100000006]
module.eks.module.eks_managed_node_group["worker-memory"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=worker-memory-eks-node-group-20231220122053332900000001-20231220122054423900000005]
module.eks.module.eks_managed_node_group["worker-memory"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"]: Refreshing state... [id=worker-memory-eks-node-group-20231220122053332900000001-20231220122054144000000002]
module.eks.module.eks_managed_node_group["worker"].aws_iam_role_policy_attachment.additional["AmazonSSMManagedInstanceCore"]: Refreshing state... [id=worker-eks-node-group-20231106143150875600000002-20231106143152315200000007]
module.eks.module.eks_managed_node_group["worker-memory"].aws_iam_role_policy_attachment.additional["AmazonSSMManagedInstanceCore"]: Refreshing state... [id=worker-memory-eks-node-group-20231220122053332900000001-20231220122054382700000004]
module.eks.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"]: Refreshing state... [id=scde-dev-us-east-1-cluster-20231106143150876200000004-20231106143152617000000009]
module.eks.aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"]: Refreshing state... [id=scde-dev-us-east-1-cluster-20231106143150876200000004-2023110614315263490000000a]
module.eks.module.kms.data.aws_iam_policy_document.this[0]: Reading...
module.eks.module.kms.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=1646506442]
module.eks.module.kms.aws_kms_key.this[0]: Refreshing state... [id=f076ea0c-68c6-49e9-84a4-5b83ba69aa8a]
module.eks.aws_security_group_rule.node["ingress_cluster_all"]: Refreshing state... [id=sgrule-2497428632]
module.eks.aws_security_group_rule.node["ingress_cluster_9443_webhook"]: Refreshing state... [id=sgrule-3849097204]
module.eks.aws_security_group_rule.node["ingress_self_all"]: Refreshing state... [id=sgrule-1429900806]
module.eks.aws_security_group_rule.node["ingress_cluster_4443_webhook"]: Refreshing state... [id=sgrule-1540614024]
module.eks.aws_security_group_rule.node["ingress_nodes_ephemeral"]: Refreshing state... [id=sgrule-2672323873]
module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"]: Refreshing state... [id=sgrule-2251039024]
module.eks.aws_security_group_rule.node["ingress_cluster_6443_webhook"]: Refreshing state... [id=sgrule-2459009054]
module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"]: Refreshing state... [id=sgrule-577995487]
module.eks.aws_security_group_rule.node["ingress_cluster_443"]: Refreshing state... [id=sgrule-2202483849]
module.eks.aws_security_group_rule.node["ingress_cluster_8443_webhook"]: Refreshing state... [id=sgrule-2177743935]
module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"]: Refreshing state... [id=sgrule-3903836815]
module.eks.aws_security_group_rule.node["egress_all"]: Refreshing state... [id=sgrule-2988468958]
module.eks.aws_security_group_rule.cluster["ingress_nodes_443"]: Refreshing state... [id=sgrule-3952938143]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy

Terraform planned the following actions, but then encountered a problem:

  # module.eks.aws_cloudwatch_log_group.this[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "this" {
        id                = "/aws/eks/scde-dev-us-east-1/cluster"
        name              = "/aws/eks/scde-dev-us-east-1/cluster"
      ~ retention_in_days = 0 -> 90
      ~ tags              = {
          + "Name" = "/aws/eks/scde-dev-us-east-1/cluster"
        }
      ~ tags_all          = {
          + "Environment"  = "dev"
          + "Name"         = "/aws/eks/scde-dev-us-east-1/cluster"
          + "Organization" = "iog"
          + "Project"      = "scde"
          + "Terraform"    = "true"
          + "Tribe"        = "smartcontracts"
        }
        # (3 unchanged attributes hidden)
    }

  # module.eks.module.eks_managed_node_group["worker-memory"].aws_iam_role.this[0] will be destroyed
  # (because module.eks.module.eks_managed_node_group["worker-memory"] is not in configuration)
  - resource "aws_iam_role" "this" {
      - arn                   = "arn:aws:iam::677160962006:role/worker-memory-eks-node-group-20231220122053332900000001" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "ec2.amazonaws.com"
                        }
                      - Sid       = "EKSNodeAssumeRole"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2023-12-20T12:20:53Z" -> null
      - description           = "EKS managed node group IAM role" -> null
      - force_detach_policies = true -> null
      - id                    = "worker-memory-eks-node-group-20231220122053332900000001" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly",
          - "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy",
          - "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy",
          - "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "worker-memory-eks-node-group-20231220122053332900000001" -> null
      - name_prefix           = "worker-memory-eks-node-group-" -> null
      - path                  = "/" -> null
      - tags                  = {
          - "k8s.io/cluster-autoscaler/enabled"            = "true"
          - "k8s.io/cluster-autoscaler/scde-dev-us-east-1" = "owned"
        } -> null
      - tags_all              = {
          - "Environment"                                  = "dev"
          - "Organization"                                 = "iog"
          - "Project"                                      = "scde"
          - "Terraform"                                    = "true"
          - "Tribe"                                        = "smartcontracts"
          - "k8s.io/cluster-autoscaler/enabled"            = "true"
          - "k8s.io/cluster-autoscaler/scde-dev-us-east-1" = "owned"
        } -> null
      - unique_id             = "AROAZ3KPQI7LBCEZBMY2Y" -> null
    }

  # module.eks.module.eks_managed_node_group["worker-memory"].aws_iam_role_policy_attachment.additional["AmazonSSMManagedInstanceCore"] will be destroyed
  # (because module.eks.module.eks_managed_node_group["worker-memory"] is not in configuration)
  - resource "aws_iam_role_policy_attachment" "additional" {
      - id         = "worker-memory-eks-node-group-20231220122053332900000001-20231220122054382700000004" -> null
      - policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore" -> null
      - role       = "worker-memory-eks-node-group-20231220122053332900000001" -> null
    }

  # module.eks.module.eks_managed_node_group["worker-memory"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"] will be destroyed
  # (because module.eks.module.eks_managed_node_group["worker-memory"] is not in configuration)
  - resource "aws_iam_role_policy_attachment" "this" {
      - id         = "worker-memory-eks-node-group-20231220122053332900000001-20231220122054262400000003" -> null
      - policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly" -> null
      - role       = "worker-memory-eks-node-group-20231220122053332900000001" -> null
    }

  # module.eks.module.eks_managed_node_group["worker-memory"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"] will be destroyed
  # (because module.eks.module.eks_managed_node_group["worker-memory"] is not in configuration)
  - resource "aws_iam_role_policy_attachment" "this" {
      - id         = "worker-memory-eks-node-group-20231220122053332900000001-20231220122054423900000005" -> null
      - policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy" -> null
      - role       = "worker-memory-eks-node-group-20231220122053332900000001" -> null
    }

  # module.eks.module.eks_managed_node_group["worker-memory"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"] will be destroyed
  # (because module.eks.module.eks_managed_node_group["worker-memory"] is not in configuration)
  - resource "aws_iam_role_policy_attachment" "this" {
      - id         = "worker-memory-eks-node-group-20231220122053332900000001-20231220122054144000000002" -> null
      - policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy" -> null
      - role       = "worker-memory-eks-node-group-20231220122053332900000001" -> null
    }

Plan: 0 to add, 1 to change, 5 to destroy.
╷
│ Error: reading KMS Key (f076ea0c-68c6-49e9-84a4-5b83ba69aa8a): reading KMS Key (f076ea0c-68c6-49e9-84a4-5b83ba69aa8a): AccessDeniedException: User: arn:aws:sts::677160962006:assumed-role/AtlantisDeploymentRole/aws-go-sdk-1705329879001049095 is not authorized to perform: kms:DescribeKey on resource: arn:aws:kms:us-east-1:677160962006:key/f076ea0c-68c6-49e9-84a4-5b83ba69aa8a because no resource-based policy allows the kms:DescribeKey action
│ 	status code: 400, request id: 0cd2257f-eeeb-479a-81af-a0e544216672
│ 
│   with module.eks.module.kms.aws_kms_key.this[0],
│   on .terraform/modules/eks.kms/main.tf line 8, in resource "aws_kms_key" "this":
│    8: resource "aws_kms_key" "this" {
│ 
╵
time=2024-01-15T14:44:39Z level=error msg=Terraform invocation failed in /atlantis-data/repos/input-output-hk/sc-dev-platform/109/default/infra/us-east-1/dev/eks/cluster/.terragrunt-cache/X8_ipbnApvSNzjOAPQiQjeScb1Y/HYSCGIWio-LIwmnQEKN75ikvccE prefix=[/atlantis-data/repos/input-output-hk/sc-dev-platform/109/default/infra/us-east-1/dev/eks/cluster] 
time=2024-01-15T14:44:39Z level=error msg=1 error occurred:
	* [/atlantis-data/repos/input-output-hk/sc-dev-platform/109/default/infra/us-east-1/dev/eks/cluster/.terragrunt-cache/X8_ipbnApvSNzjOAPQiQjeScb1Y/HYSCGIWio-LIwmnQEKN75ikvccE] exit status 1





```
</details>

---
### 2. dir: `infra/us-east-1/mgmt/ecr` workspace: `default`
<details><summary>Show Output</summary>

```diff
time=2024-01-15T14:44:40Z level=warning msg=No double-slash (//) found in source URL /terraform-aws-modules/terraform-aws-ecr.git. Relative paths in downloaded Terraform code may not work.

Initializing the backend...

Initializing provider plugins...
- Finding hashicorp/aws versions matching ">= 4.22.0"...
- Installing hashicorp/aws v5.32.1...
- Installed hashicorp/aws v5.32.1 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!
data.aws_caller_identity.current: Reading...
data.aws_partition.current: Reading...
data.aws_partition.current: Read complete after 0s [id=aws]
data.aws_caller_identity.current: Read complete after 0s [id=677160962006]
data.aws_iam_policy_document.repository[0]: Reading...
data.aws_iam_policy_document.repository[0]: Read complete after 0s [id=3792795651]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ecr_lifecycle_policy.this[0] will be created
+   resource "aws_ecr_lifecycle_policy" "this" {
+       id          = (known after apply)
+       policy      = jsonencode(
            {
+               rules = [
+                   {
+                       action       = {
+                           type = "expire"
                        }
+                       description  = "keep last 20 images"
+                       rulePriority = 10
+                       selection    = {
+                           countNumber = 20
+                           countType   = "imageCountMoreThan"
+                           tagStatus   = "any"
                        }
                    },
+                   {
+                       action       = {
+                           type = "expire"
                        }
+                       description  = "Expire untagged images older than 14 days"
+                       rulePriority = 1
+                       selection    = {
+                           countNumber = 1
+                           countType   = "sinceImagePushed"
+                           countUnit   = "days"
+                           tagStatus   = "untagged"
                        }
                    },
                ]
            }
        )
+       registry_id = (known after apply)
+       repository  = "scde"
    }

  # aws_ecr_repository.this[0] will be created
+   resource "aws_ecr_repository" "this" {
+       arn                  = (known after apply)
+       id                   = (known after apply)
+       image_tag_mutability = "IMMUTABLE"
+       name                 = "scde"
+       registry_id          = (known after apply)
+       repository_url       = (known after apply)
+       tags_all             = (known after apply)

+       encryption_configuration {
+           encryption_type = "AES256"
+           kms_key         = (known after apply)
        }

+       image_scanning_configuration {
+           scan_on_push = true
        }
    }

  # aws_ecr_repository_policy.this[0] will be created
+   resource "aws_ecr_repository_policy" "this" {
+       id          = (known after apply)
+       policy      = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = [
+                           "ecr:ListTagsForResource",
+                           "ecr:ListImages",
+                           "ecr:GetRepositoryPolicy",
+                           "ecr:GetLifecyclePolicyPreview",
+                           "ecr:GetLifecyclePolicy",
+                           "ecr:GetDownloadUrlForLayer",
+                           "ecr:GetAuthorizationToken",
+                           "ecr:DescribeRepositories",
+                           "ecr:DescribeImages",
+                           "ecr:DescribeImageScanFindings",
+                           "ecr:BatchGetImage",
+                           "ecr:BatchCheckLayerAvailability",
                        ]
+                       Effect    = "Allow"
+                       Principal = {
+                           AWS = "arn:aws:iam::677160962006:root"
                        }
+                       Sid       = "PrivateReadOnly"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       registry_id = (known after apply)
+       repository  = "scde"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   repository_arn         = (known after apply)
+   repository_registry_id = (known after apply)
+   repository_url         = (known after apply)
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infra/us-east-1/mgmt/ecr`
* :put_litter_in_its_place: To **delete** this plan click [here](http://k8s-default-atlantis-91ad56e657-af175fe4f3d67964.elb.us-east-1.amazonaws.com/lock?id=input-output-hk%252Fsc-dev-platform%252Finfra%252Fus-east-1%252Fmgmt%252Fecr%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infra/us-east-1/mgmt/ecr`
</details>
Plan: 3 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`